<script setup lang="ts">

</script>

<template>
  <div>
    <div class="section-container">
      <div class="contents">
        <div>
          <h1>すきなもの</h1>
        </div>
        <div class="texts">
          <section>
            <h2>宇宙</h2>
            <p>小さいころから宇宙が好きです。つくばにいたので、当然の帰結だと思っています。</p>
            <p>基本的につくばセンターの一般公開には毎年いきます。ISASの方は余裕があれば行きます。</p>
            <p>tansaが好きで、LUNAR CRUISERのファンです。</p>
            <p>好きな人工衛星はきく7号で、その系譜としてこうのとりにも熱狂していました。同様にHTV-Xにも熱狂しています。</p>
          </section>
          <section>
            <h2>サッカー</h2>
            <p>サッカーは3歳くらいから中学卒業までやっていました。</p>
            <p>地元にアカデミーもあったので、鹿島アントラーズが好きです。</p>
            <p>出不精すぎてスタジアムに行った経験が片手で数えるほどしかないのでサポーターとは自称できないですが、ここ4、5年はほとんど全試合見ています。</p>
            <p>大学サッカーにも希望と好感があって、日本サッカーの優位性だと思っています。大学出身の選手が活躍していると嬉しいです。</p>
            <p>筑波大蹴球部は、ちょうど車屋さんの世代をたくさん見ていたため、ファンボです。</p>
            <p>海外サッカーはほとんど見ないですが、5大リーグにいる日本人選手のハイライトくらいはかじります。</p>
          </section>
          <section>
            <h2>スキー</h2>
            <p>親の影響で小さいころから冬場はスキーをしていました。</p>
            <p>Atomicユーザーで、RedSterを履いています。</p>
            <p>板がS8i、ブーツがTI110です</p>
            <p>斜度が30度くらいまでの圧雪バーンならそこそこ滑れますが、別にうまくないです。</p>
            <p>ボードも数回やりましたが、そっちはまだあまりハマれていません。</p>
          </section>
          <section>
            <h2>料理</h2>
            <p>昔からプロの料理を真似るのが好きです。</p>
            <p>フレンチとイタリアンを作るのが好きでしたが、病気になってからほとんどのメニューが食べれないので最近は全然作っていないです。</p>
            <p>YouTubeでシェフの料理動画をみて、まねして楽しんでいました。</p>
            <p>Ropiaさん、Georgeさん、ファビオさん、ポールボキューズの星野シェフ、帝国ホテルの杉本シェフ、Regaloの小倉シェフなどを見ています。</p>
            <p>ひとり暮らしの前に、実家の贅沢なキッチンでたくさん勉強できたのはひとり暮らしでの自炊に生きているかなとも思います。</p>
            <p>手を抜いていいところがわかるので。</p>
          </section>
          <section>
            <h2>etc...</h2>
            <p>その他ですが、まずはアニメを見ます。が、ほとんど履修していないのでアニメの話にはついていけない傾向にあります。</p>
            <p>VTuberも企業所属ならそこそこわかります。声の低い女が好きです。個人Vだと、最近は敷島てとらさんにお熱です。</p>
            <p>この通り、ど真ん中のサブカルオタクなので、YouTubeではmorgenさん、たむらかえさん、雷獣みたいな部分を見ています。</p>
            <p>YouTubeはかなり黎明期から見ているので、広く浅く応援していると思います。ジェットダイスケさん、瀬戸弘司さん、PDSさん、PDRさんなんかは見かけると嬉しい気持ちになります。</p>
            <p>ゲームもPCゲームならやります。最近はValorantでシルバースタックしています。幼少期のゲーム経験がほとんどないので、本質的にゲームが下手です。</p>
            <p>ESports観戦も好きです。今はValorantの競技シーンをよく見ていますし、少し前はApexを見ていました。</p>
            <p>YouTubeっ子なので、断片的にいろいろな記憶があります。PUBGだったり、シージだったり、CSだったり。ちゃんと見ていたのはApex以降ですが。</p>
          </section>
        </div>
      </div>
    </div>
  </div>
</template>

<style scoped>
h1 {
  font-size: 2rem;
  grid-column: 2/4;
}

.section-container {
  display: grid;
  grid-template-columns: repeat(5, minmax(0, 1fr));
}

.contents {
  display: flex;
  flex-direction: column;
  gap: 3rem;
  grid-column: 2/5;
}

.texts {
  display: flex;
  flex-direction: column;
  gap: 2rem;
}
</style>
